Revit 2026 API

# ParameterSet(ElementId) Method

---

Sets the parameter to a new element id.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool Set(
	ElementId value
)
```
```vb
Public Function Set (
	value As ElementId
) As Boolean
```
```cpp
public:
bool Set(
	ElementId^ value
)
```
```fsharp
member Set :
        value : ElementId -> bool
```

#### Parameters

value ElementId
    The new element id to which the parameter is to be set.

#### Return Value

BooleanThe Set method will return True if the parameter was successfully set to the new value, otherwise false.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The parameter is read-only. |

You should only use this method if the StorageType property reports the type of the parameter as an ElementId.

#### Reference

Parameter Class

Set Overload

Autodesk.Revit.DB Namespace